<?php

use Adideas\ChatApp\ChatApp\Client\Curl;
use Adideas\ChatApp\ChatApp\Client\Guzzle;

return [
    /*
    |----------------------------------------------------------------------------------
    | Обновлять токен в очереди
    |----------------------------------------------------------------------------------
     */
    'refresh_in_job' => !!env('CHAT_APP_REFRESH_IN_JOB', false),

    /**
    |----------------------------------------------------------------------------------
    | Выбор клиента (или использование своего)
    |----------------------------------------------------------------------------------
     * @see Guzzle::class
     * @see Curl::class
     */
    'client' => Guzzle::class,

    /*
    |----------------------------------------------------------------------------------
    | Конфигурация АПИ
    |----------------------------------------------------------------------------------
     */
    'api' => [
        'prefix' => env('CHAT_APP_API_PREFIX','api/chat_app_api'),
        'middleware' => []
    ],

    /*
    |----------------------------------------------------------------------------------
    | Конфигурация Веб хуков
    |----------------------------------------------------------------------------------
     */
    'web_hook' => [
        'prefix' => env('CHAT_APP_WEB_HOOK_PREFIX','chat_app_web_hook'),
        'middleware' => []
    ]
];
